-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Dec 23, 2025 at 07:49 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.5.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `training-system`
--

-- --------------------------------------------------------

--
-- Table structure for table `trainees`
--

CREATE TABLE `trainees` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `national_id` varchar(255) NOT NULL,
  `full_name` varchar(255) NOT NULL,
  `phone_number` varchar(255) NOT NULL,
  `dob` date NOT NULL,
  `governorate_id` bigint(20) UNSIGNED DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `street` varchar(255) DEFAULT NULL,
  `institution_id` bigint(20) UNSIGNED DEFAULT NULL,
  `college_id` bigint(20) UNSIGNED DEFAULT NULL,
  `major_id` bigint(20) UNSIGNED DEFAULT NULL,
  `training_hours` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `trainees`
--

INSERT INTO `trainees` (`id`, `national_id`, `full_name`, `phone_number`, `dob`, `governorate_id`, `address`, `street`, `institution_id`, `college_id`, `major_id`, `training_hours`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, '6003267785', 'نسيم يزن باسل الحميد', '(530) 536-1333', '2018-03-05', 1, '5588 طريق أصاله الخالدي شقة رقم. 69\nتبوك', 'شارع إسلام السماري', 6, 44, 39, 418, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(2, '0378797709', 'عودة المطرفي', '646.812.6378', '1980-01-13', 3, '71351 طريق أمنة السليم شقة رقم. 18\nشرورة', 'طريق جريس الحسين', 5, 21, 178, 428, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(3, '3168253756', 'مرح السماعيل', '878-908-6860', '1971-07-10', 3, '94101 ممر عصام الزامل عمارة رقم 63\nالهفوف', 'ممر أميرة المنيف', 1, 57, 113, 168, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(4, '6591612680', 'بسام عبدالحميد عوني القحطاني', '+1-321-909-0640', '2012-03-07', 1, '25962 طريق نزال الحميد عمارة رقم 87\nبيشة', 'شارع صفا الفرحان', 3, 47, 63, 118, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(5, '4436230088', 'عبد اللطيف سقا', '(952) 876-5667', '2023-12-09', 5, '41 طريق زياد الصقير عمارة رقم 38\nينبع البحر', 'شارع زمام الشهري', 1, 15, 45, 380, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(6, '2072475096', 'هانى السمير', '+19785366049', '1996-10-22', 4, '91667 شارع عثمان الخضيري\nالحوية', 'ممر عادل الفرحان', 12, 43, 56, 118, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(7, '4324714355', 'عزة احسان الأحمري', '+1 (754) 410-4852', '2005-03-12', 4, '21 شارع منار الحصين\nضباء', 'شارع اسماعيل الصقيه', 10, 34, 137, 322, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(8, '1857528878', 'الآنسة لمى الخضيري', '878-987-4325', '2003-06-09', 5, '6660 ممر حمدان الشهري\nالمبرز', 'شارع ميناس المطرفي', 9, 21, 88, 382, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(9, '4850016058', 'جمال الصقير', '631-855-6779', '2008-08-06', 3, '51 ممر سمية السهلي شقة رقم. 95\nبيشة', 'طريق فدى الأسمري', 11, 32, 190, 155, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(10, '4726972008', 'المهندسة إباء العنزي', '1-331-252-5285', '1993-11-23', 4, '99261 شارع سيرينا الأحمري\nجيزان', 'ممر أمل الشهيل', 4, 8, 2, 314, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(11, '9315467950', 'صدام ناصر عودة الزامل', '757-416-8893', '1980-11-01', 1, '27 شارع رنيم جواهرجي\nوادي الدواسر', 'طريق أميرة الخالدي', 1, 55, 105, 114, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(12, '2467816403', 'جميل مصعب العسكر', '(303) 313-3463', '2014-06-28', 1, '9015 ممر دارين الخالدي\nالقطيف', 'شارع لبنا السهلي', 13, 35, 111, 492, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(13, '5869273859', 'رنده عبد الفتاح العرفج', '(360) 440-1631', '2005-01-19', 5, '9990 ممر إسراء الأحمري\nالقطيف', 'شارع نجاح برماوي', 13, 47, 137, 473, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(14, '1713857564', 'الآنسة أنوار الماجد', '517-977-6119', '2009-02-05', 4, '25491 طريق ندين برماوي\nبيشة', 'شارع صفوان الفدا', 7, 56, 82, 353, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(15, '2661053100', 'وئام السهلي', '+1 (912) 491-3713', '1986-08-31', 4, '4453 ممر سهم الفيفي\nبيشة', 'شارع صافي العنزي', 3, 26, 173, 460, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(16, '9826265065', 'الآنسة عاليا الصقيه', '1-681-937-8265', '1973-07-04', 3, '6735 ممر عبد الباري الداوود\nالطائف', 'طريق فريال الجهني', 1, 54, 121, 193, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(17, '7548138686', 'نهاد صلاح الدين المقبل', '1-320-267-1709', '2016-08-03', 3, '23 شارع بشار الراجحي\nخميس مشيط', 'طريق مها السماري', 1, 43, 172, 150, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(18, '4619966805', 'محسن عبد السميع امين العقل', '1-346-984-8423', '2022-05-05', 3, '1784 طريق ركان الحنتوشي عمارة رقم 44\nمكة', 'ممر عبداللطيف الشهري', 3, 60, 84, 336, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(19, '9254219010', 'لطيفة مجد نوفان القحطاني', '+1-952-210-1178', '1991-12-06', 3, '6753 طريق نور الهدى الحميد\nالقريات', 'ممر وداد السهلي', 12, 25, 52, 177, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(20, '4183947309', 'رغدة الجهني', '832.266.1011', '2006-03-10', 2, '94 ممر عزة السليم\nالدوادمي', 'طريق صهيب الفيفي', 1, 2, 51, 423, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(21, '6389953594', 'المهندسة نوران الجهني', '(360) 917-6056', '2002-08-20', 3, '62 طريق نهاد سقا شقة رقم. 51\nسيهات', 'ممر طه سقا', 6, 14, 97, 219, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(22, '8139385904', 'فاخر الصامل', '484-359-4362', '1996-09-01', 5, '13 طريق هزار القحطاني شقة رقم. 30\nالمبرز', 'شارع ضياء السهلي', 2, 43, 200, 426, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(23, '2570831508', 'وعد سقا', '516-775-3913', '2009-05-24', 1, '26 طريق اسيل الفرحان\nجيزان', 'ممر وعد الجريد', 6, 47, 175, 251, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(24, '8999453675', 'العزم السويلم', '337-758-6274', '2016-01-07', 5, '31216 ممر ثامر المقبل عمارة رقم 02\nينبع البحر', 'ممر اياد العتيبي', 4, 11, 40, 381, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(25, '9580045005', 'لينا الجهني', '+19497936359', '1975-08-22', 1, '11 طريق حسام الأسمري شقة رقم. 45\nخميس مشيط', 'طريق عبدالجليل السليم', 7, 29, 193, 409, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(26, '5411065242', 'قبلان السمير', '+1-424-879-2434', '2023-03-19', 5, '1009 ممر اسيل مكي عمارة رقم 26\nالأحساء', 'ممر تولين الزامل', 12, 41, 134, 260, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(27, '4659509817', 'اسامة الشهري', '+1-681-516-7577', '1978-05-06', 1, '69477 طريق نبيل العنزي شقة رقم. 87\nجيزان', 'طريق أمينة السعيد', 13, 6, 204, 291, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(28, '9656779068', 'مجد عبد المولى عبادة العرفج', '(430) 319-1292', '2001-07-07', 1, '37499 ممر يعقوب مكي شقة رقم. 80\nالمبرز', 'ممر شيرين الحصين', 12, 29, 46, 137, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(29, '8324011879', 'أحمد السمير', '870.961.7690', '1984-10-05', 3, '6442 شارع سيما السالم شقة رقم. 04\nضباء', 'طريق عبدالفتاح الجريد', 5, 15, 96, 195, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(30, '0607785142', 'الدكتورة روزانا الفريدي', '(508) 323-6111', '1995-08-29', 1, '6108 شارع ربيع المشيقح شقة رقم. 24\nحفر الباطن', 'طريق صمود الجريد', 2, 13, 58, 433, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(31, '2518107151', 'عرمان راكان الأسمري', '1-520-780-5733', '1975-05-04', 4, '25 ممر حبيب الماجد\nالهفوف', 'شارع جنى الداوود', 10, 28, 178, 218, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(32, '9321259843', 'رغد عبداللطيف كريم هوساوي', '432.253.0596', '1987-02-03', 5, '5263 طريق مهدي الحنتوشي عمارة رقم 36\nالدمام', 'شارع فيروز الأسمري', 6, 22, 72, 409, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(33, '2737851584', 'ميران العقل', '1-610-667-1944', '1977-10-25', 1, '8976 ممر عقل الحسين\nسكاكا', 'ممر رواء الجهني', 2, 4, 201, 451, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(34, '7097403250', 'آمال الصامل', '1-351-658-6870', '1998-08-06', 5, '5387 شارع يحيى جواهرجي شقة رقم. 91\nوادي الدواسر', 'ممر اعتدال برماوي', 10, 43, 50, 458, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(35, '3157758273', 'سيما الخالدي', '+1.239.749.2013', '1993-01-16', 1, '23505 طريق رمال السليم\nتبوك', 'ممر فارس العمرو', 12, 12, 116, 437, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(36, '0674928833', 'هلا الحسين مدني', '+1 (830) 427-3097', '2010-11-11', 1, '81854 طريق راجي باشا عمارة رقم 91\nالأفلاج', 'شارع يسار الصقيه', 12, 58, 115, 199, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(37, '7263482815', 'حنين العتيبي', '1-747-650-7488', '1974-11-20', 4, '72 شارع زهرة السليم\nالخرج', 'طريق عبيدة الشهري', 7, 38, 185, 144, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(38, '6757686801', 'المهندسة اسرار السويلم', '+1-425-826-6308', '1990-04-02', 2, '72 ممر ردينة الفدا\nشرورة', 'ممر رأفت الحنتوشي', 3, 51, 134, 201, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(39, '0595707023', 'رمال سقا', '(520) 970-7639', '1988-10-04', 3, '46 شارع راغدة الصقيه شقة رقم. 78\nالطائف', 'شارع نعمان برماوي', 3, 53, 58, 324, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(40, '4282571901', 'مفلح السعيد', '+14754886289', '2001-10-01', 1, '7744 ممر داوود سقا شقة رقم. 70\nالخرج', 'شارع رشا الأسمري', 1, 17, 192, 346, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(41, '8377846350', 'شامل المشيقح', '(630) 855-7002', '2020-04-12', 3, '9259 شارع فرح السمير شقة رقم. 02\nينبع البحر', 'طريق آثار باشا', 11, 1, 29, 250, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(42, '8238968039', 'عوف قيس الفريدي', '1-813-234-7317', '1979-04-12', 4, '36597 طريق نزار الخالدي\nالدمام', 'شارع تمارا العنزي', 5, 63, 80, 436, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(43, '4641636860', 'سنابل السماعيل', '(678) 250-8955', '2005-11-09', 1, '23522 شارع هادلين الراجحي شقة رقم. 40\nالأحساء', 'ممر ليدا الشيباني', 3, 39, 85, 394, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(44, '9221970292', 'عماد السيف', '+1-785-881-5284', '1972-11-22', 2, '25840 طريق نبيل الفرحان شقة رقم. 97\nالقطيف', 'شارع محسن برماوي', 8, 5, 193, 124, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(45, '8400352056', 'يزيد المقبل', '+1-941-615-3214', '2010-01-01', 3, '80 ممر طلال مدني شقة رقم. 97\nالرياض', 'شارع ميار الصقير', 9, 27, 52, 267, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(46, '6002702422', 'الدكتورة بيان الشيباني', '(559) 327-9154', '2006-11-24', 4, '6638 شارع جراح باشا\nجيزان', 'شارع لورا الشهيل', 1, 18, 194, 146, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(47, '4013651866', 'ميرفت رامان نعيم السيف', '+19035971890', '2005-04-30', 3, '9036 طريق نبيل العرفج\nينبع البحر', 'ممر ميادة الصامل', 9, 15, 100, 170, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(48, '5010331075', 'نيروز هانى نزال السمير', '1-743-840-3097', '2025-11-23', 3, '6695 طريق رويدة الحسين عمارة رقم 67\nجدة', 'شارع حمد الأحمري', 7, 33, 145, 482, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(49, '6835901943', 'نور الهدى ايسر جواهرجي', '+1-743-910-3919', '1992-07-07', 3, '42591 ممر همام العسكر\nالجبيل', 'طريق أنس السماري', 3, 26, 18, 189, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL),
(50, '8170175724', 'شهم صلاح رؤوف الداوود', '1-432-481-5714', '2013-12-18', 3, '60 شارع روزين هوساوي\nالرس', 'طريق علا باشا', 12, 44, 99, 467, '2025-12-23 04:50:53', '2025-12-23 04:50:53', NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `trainees`
--
ALTER TABLE `trainees`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `trainees_national_id_unique` (`national_id`),
  ADD KEY `trainees_governorate_id_foreign` (`governorate_id`),
  ADD KEY `trainees_institution_id_foreign` (`institution_id`),
  ADD KEY `trainees_college_id_foreign` (`college_id`),
  ADD KEY `trainees_major_id_foreign` (`major_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `trainees`
--
ALTER TABLE `trainees`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `trainees`
--
ALTER TABLE `trainees`
  ADD CONSTRAINT `trainees_college_id_foreign` FOREIGN KEY (`college_id`) REFERENCES `colleges` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `trainees_governorate_id_foreign` FOREIGN KEY (`governorate_id`) REFERENCES `governorates` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `trainees_institution_id_foreign` FOREIGN KEY (`institution_id`) REFERENCES `institutions` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `trainees_major_id_foreign` FOREIGN KEY (`major_id`) REFERENCES `majors` (`id`) ON DELETE SET NULL;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
