<?php

return [
    // Centralized translations for dynamic items (status, etc.)
    'status' => [
        1 => 'طلب جديد',
        2 => 'قبول مبدئي',
        3 => 'قبول مبدئي',
        4 => 'في قائمة الانتظار',
        5 => 'بدء التدريب',
        6 => 'انتهى التدريب',
        7 => 'مرفوض',
        8 => 'معلق',
        9 => 'غير معروف',
    ],

    // Gaza Governorates
    'governorates' => [
        1 => 'مدينة غزة',
        2 => 'شمال غزة',
        3 => 'دير البلح',
        4 => 'خان يونس',
        5 => 'رفح',
    ],
];
